In [4]:
import pandas as pd
import seaborn as sns

# Seaborn은 파이썬에서 데이터 시각화를 담당하는 모듈입니다. 
# 매력적이고 유익한 통계 그래픽을 그리기 위한 고급 인터페이스를 제공합니다

import numpy as np

In [5]:
df = sns.load_dataset('iris')
# iris 무슨 꽃같은 데이터 셋. 데이터프레임 라이브러리 패시브 데이터
df.shape

(150, 5)

In [6]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [7]:
df['species'].value_counts() #각각의 값을 그룹화해서 갯수 세어줌

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [8]:
df['petal_width'].value_counts()

0.2    29
1.3    13
1.8    12
1.5    12
1.4     8
2.3     8
1.0     7
0.4     7
0.3     7
2.1     6
2.0     6
0.1     5
1.2     5
1.9     5
1.6     4
2.5     3
2.2     3
2.4     3
1.1     3
1.7     2
0.6     1
0.5     1
Name: petal_width, dtype: int64

In [9]:
pd.DataFrame(df['species'].value_counts())

            species
setosa           50
versicolor       50
virginica        50

In [10]:
len(df)

150

In [11]:
df.shape[0]

150

In [12]:
df['species'].nunique() # 'species'의 가짓수

3

In [13]:
df.describe() # 통계적 수치, 수,

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [14]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [18]:
df.describe() # ''에 [np.number] 하면 숫자형태만 등등

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [21]:
df.describe?

In [28]:
df.describe(include=[np.object]) # 오브젝트 형태만

C:\Users\user\AppData\Local\Temp/ipykernel_6424/107097867.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  df.describe(include=[np.object]) # 오브젝트 형태만

       species
count      150
unique       3
top     setosa
freq        50

In [29]:
df.describe(include=[np.number])

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [16]:
df['petal_width'].sum()

179.90000000000003

In [17]:
df['species'].nunique()

3

```
sum()
Sum values of each object.
count()
Count non-NA/null values of
each object.
median()
Median value of each object.
quantile([0.25,0.75])
Quantiles of each object.
apply(function)
Apply function to each object.
min()
Minimum value in each object.
max()
Maximum value in each object.
mean()
Mean value of each object.
var()
Variance of each object.
std()
Standard deviation of each
object.
```

In [18]:
df['petal_width'].sum()

179.90000000000003

In [19]:
df['petal_width'].count()

150

In [20]:
df['petal_width'].median()

1.3

In [21]:
df['petal_width'].mean()

1.199333333333334

In [22]:
df['petal_width'].quantile([0.25, 0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [23]:
df.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [24]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [25]:
df.var()

C:\Users\user\AppData\Local\Temp/ipykernel_19196/1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [26]:
df.std()

C:\Users\user\AppData\Local\Temp/ipykernel_19196/3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

apply(function)

In [27]:
df.apply?

In [30]:
df.apply(lambda x : x[0])

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [35]:
df['species_3'] = df['species'].apply(lambda x : x[0])
df

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa         s
1             4.9          3.0           1.4          0.2     setosa         s
2             4.7          3.2           1.3          0.2     setosa         s
3             4.6          3.1           1.5          0.2     setosa         s
4             5.0          3.6           1.4          0.2     setosa         s
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica         v
146           6.3          2.5           5.0          1.9  virginica         v
147           6.5          3.0           5.2          2.0  virginica         v
148           6.2          3.4           5.4          2.3  virginica         v
149           5.9          3.0           5.1          1.8  virginica         v

[150 rows x 6 columns]

In [38]:
df['species-3'] = df['species'].apply(lambda x : x[:3])
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,set
1,4.9,3.0,1.4,0.2,setosa,set,set
2,4.7,3.2,1.3,0.2,setosa,set,set
3,4.6,3.1,1.5,0.2,setosa,set,set
4,5.0,3.6,1.4,0.2,setosa,set,set
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,vir
146,6.3,2.5,5.0,1.9,virginica,vir,vir
147,6.5,3.0,5.2,2.0,virginica,vir,vir
148,6.2,3.4,5.4,2.3,virginica,vir,vir
149,5.9,3.0,5.1,1.8,virginica,vir,vir

In [39]:
def smp(x):
    # 뒤에서 3번째까지 문자 가져오기
    x = x[-3:]
    return x

In [42]:
df['species-3'] = df['species'].apply(smp)
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica